src/bsl/DataProcessors/гкс_АРМПромежуточныйКомпозит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>гкс_АРМПромежуточныйКомпозит</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСостояний</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Силос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСуткиРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистраций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СостоянияРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СостоянияРегистрации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияРегистрации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_НазначенияИспользованияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_НазначенияИспользованияКачества</Name>
			<Comment>ERP-2184</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаКомпозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлеваторВнешниеПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛаборантВнешниеПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпозитВнешниеПробыНаТысячуТон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточныйКомпозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйАнализ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_СостоянияРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенБрутто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятоПоПревышениюМаксимальногоВеса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтборуПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятыПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатыПробПолучены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоНеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаРазрешена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Убыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогрузкаРазрешена</Name>
					<Comment>ERP-2029</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погружен</Name>
					<Comment>ERP-2029</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Documents/гкс_ФормированиеНомераПробы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_ФормированиеНомераПробы</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПробы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_НомерПробы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСуткиРегистрации</Name>
					<Comment>ERP-1431</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокРегистраций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/DataProcessors/гкс_АРМПромежуточныйКомпозит/Forms/ФормаФормированиеКомпозитнойФормы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ВыполнитьПроверкуСтраницы(Параметры) Тогда

		ДопПараметры = Параметры.ДопПараметры;

		// Таблица регистраций уже заполнена из отмеченных строк в предыдущей форме
		Если Не ДопПараметры.Свойство("МассивСтрокДанных")
			Или ДопПараметры.МассивСтрокДанных.Количество() = 0 Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(Объект, ДопПараметры);

		// Заполняем таблицу регистраций из отмеченных строк
		Объект.ТаблицаРегистраций.Очистить();
		Для Каждого СтруктураСтроки Из ДопПараметры.МассивСтрокДанных Цикл
			НоваяСтрока = Объект.ТаблицаРегистраций.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
		КонецЦикла;

		Если СтраницаПроизвольныйКомпозит Тогда
			ЗаполнитьПоказателиИзНормативнойСертификацииНаСервере(ДопПараметры);
		Иначе
			Для Каждого Показатель Из ДопПараметры.МассивПоказателей Цикл
				НоваяСтрока = Объект.Показатели.Добавить();
				НоваяСтрока.Показатель = Показатель;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	ТипВыбранногоЗначения = ТипЗнч(ВыбранноеЗначение);

	Если ТипВыбранногоЗначения = Тип("СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры") Тогда
		ДобавитьПоказательВТаблицу(ВыбранноеЗначение);
	ИначеЕсли ТипВыбранногоЗначения = Тип("Массив") Тогда
		Для Каждого ВыбранныйПоказатель Из ВыбранноеЗначение Цикл
			ДобавитьПоказательВТаблицу(ВыбранныйПоказатель);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказатели

&НаКлиенте
Процедура ПоказателиПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Показатели.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.Показатель) Тогда
		Возврат;
	КонецЕсли;

	НайденыйПоказатели = Объект.Показатели.НайтиСтроки(Новый Структура("Показатель", ТекущиеДанные.Показатель));
	Если НайденыйПоказатели.Количество() > 1 Тогда
		Индекс = Объект.Показатели.Индекс(ТекущиеДанные);
		Если Индекс <> Неопределено Тогда
			Объект.Показатели.Удалить(Индекс);
		КонецЕсли;

	Иначе
		ВыполнитьПроверкуНормативовПоказателя(ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСформироватьПромежуточныйКомпозит(Команда)

	СформироватьДокумент();
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоказательПоСпецификации(Команда)

	Если НормативныеПоказатели.Количество() = 0 Тогда
		ПоказатьПредупреждение( , "Нет доступных показателей из нормативной сертификации для данной номенклатуры.");
		Возврат;
	КонецЕсли;

	// Получаем список уже добавленных показателей
	УжеДобавленныеПоказатели = ПолучитьДобавленныеПоказатели();

	// Формируем список доступных для выбора (нормативные МИНУС уже добавленные)
	ДоступныеДляВыбора = Новый Массив;
	Для Каждого НормативныйПоказатель Из НормативныеПоказатели Цикл
		Если УжеДобавленныеПоказатели.Найти(НормативныйПоказатель.Значение) = Неопределено Тогда
			ДоступныеДляВыбора.Добавить(НормативныйПоказатель.Значение);
		КонецЕсли;
	КонецЦикла;

	Если ДоступныеДляВыбора.Количество() = 0 Тогда
		ПоказатьПредупреждение( , "Все нормативные показатели уже добавлены в таблицу.");
		Возврат;
	КонецЕсли;

	ПараметрыФормы = ПолучитьПараметрыФормыДляНормативныхПоказателей(ДоступныеДляВыбора);

	ОткрытьФорму("Справочник.гкс_ПоказателиАнализовНоменклатуры.ФормаВыбора",
		ПараметрыФормы,
		ЭтотОбъект, // Владелец - текущая форма (важно для вызова ОбработкаВыбора!)
		УникальныйИдентификатор,
		,
		,
		, // Оповещение НЕ требуется - используется ОбработкаВыбора
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#Область ВидимостьДоступность

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	Элементы.ГруппаПоказатели.Доступность = СтраницаПроизвольныйКомпозит;
КонецПроцедуры
#КонецОбласти

&НаСервере
Функция ПроверитьПараметры()
	Возврат Не ЗначениеЗаполнено(Объект.Номенклатура)
		Или Не ЗначениеЗаполнено(Объект.ТочкаМаршрута)
		Или Не ЗначениеЗаполнено(Объект.ВидПеревозки);
КонецФункции

// Извлекает заполненные показатели из табличной части
//
// Параметры:
//  ТабличнаяЧасть - ТабличнаяЧасть - табличная часть с показателями
//
// Возвращаемое значение:
//  Массив - массив ссылок на показатели
//
&НаСервереБезКонтекста
Функция ПолучитьМассивПоказателей(ТабличнаяЧасть)

	Показатели = Новый Массив;

	Для Каждого СтрокаПоказатель Из ТабличнаяЧасть Цикл
		Если ЗначениеЗаполнено(СтрокаПоказатель.Показатель) Тогда
			Показатели.Добавить(СтрокаПоказатель.Показатель);
		КонецЕсли;
	КонецЦикла;

	Возврат Показатели;

КонецФункции

// Создает массив структур показателей для передачи в документ
//
// Параметры:
//  ТабличнаяЧасть - ТабличнаяЧасть - табличная часть с показателями
//  УсиленныйКонтроль - Булево - признак усиленного контроля
//
// Возвращаемое значение:
//  Массив - массив структур с данными показателей или Неопределено
//
&НаСервереБезКонтекста
Функция СформироватьМассивСтруктурПоказателей(ТабличнаяЧасть, УсиленныйКонтроль)

	МассивПоказателей = Новый Массив;

	Для Каждого СтрокаПоказатель Из ТабличнаяЧасть Цикл
		Если Не ЗначениеЗаполнено(СтрокаПоказатель.Показатель) Тогда
			Продолжить;
		КонецЕсли;

		СтруктураПоказателя = Новый Структура;
		СтруктураПоказателя.Вставить("Показатель", СтрокаПоказатель.Показатель);
		СтруктураПоказателя.Вставить("ЕдиницаИзмерения", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			СтрокаПоказатель.Показатель, "ЕдиницаИзмерения"));
		СтруктураПоказателя.Вставить("УсиленныйКонтроль", УсиленныйКонтроль);
		МассивПоказателей.Добавить(СтруктураПоказателя);
	КонецЦикла;

	Если МассивПоказателей.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат МассивПоказателей;

КонецФункции


// Подготавливает параметры создания лабораторного анализа
//
// Параметры:
//  МассивПоказателей - Массив - массив структур показателей или Неопределено
//
// Возвращаемое значение:
//  Структура - параметры для создания анализа
//
&НаСервереБезКонтекста
Функция ПодготовитьПараметрыСозданияАнализа(МассивПоказателей, СтраницаУсиленныйКонтроль)
	ПараметрыСозданияАнализа = Новый Структура;

	Если СтраницаУсиленныйКонтроль Тогда
		НазначениеИспользованияКачества = Перечисления.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит;
	Иначе
		НазначениеИспользованияКачества = Перечисления.гкс_НазначенияИспользованияКачества.ДополнительныйАнализ;
	КонецЕсли;

	ПараметрыСозданияАнализа.Вставить("гкс_НазначениеИспользованияКачества", НазначениеИспользованияКачества);
	ПараметрыСозданияАнализа.Вставить("ПоказателиДляЗаполнения", МассивПоказателей);

	Возврат ПараметрыСозданияАнализа;

КонецФункции

&НаСервере
Процедура СформироватьДокумент()


	Если Объект.ТаблицаРегистраций.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Попытка

		// Получение таблицы регистраций с учетом усиленного контроля
		ТаблицаПринятыхРегистраций = Объект.ТаблицаРегистраций.Выгрузить();
		Если СтраницаУсиленныйКонтроль Или СтраницаУсиленныйКонтрольДляТС Тогда
			Показатели = ПолучитьМассивПоказателей(Объект.Показатели);
		КонецЕсли;

		// Формируем композитную пробу только из регистраций с принятым качеством
		Если ТаблицаПринятыхРегистраций.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;

		// Подготовка параметров для создания документов
		ПризнакУсиленныйКонтроль = СтраницаУсиленныйКонтроль Или СтраницаУсиленныйКонтрольДляТС;
		МассивПоказателей = СформироватьМассивСтруктурПоказателей(Объект.Показатели, ПризнакУсиленныйКонтроль);
		ПараметрыСозданияАнализа = ПодготовитьПараметрыСозданияАнализа(МассивПоказателей, ПризнакУсиленныйКонтроль);

		ПараметрыСоздания = Новый Структура;
		ПараметрыСоздания.Вставить("ТочкаМаршрута", Объект.ТочкаМаршрута);
		ПараметрыСоздания.Вставить("ПроизводственныеСуткиРегистрации", Объект.ПроизводственныеСуткиРегистрации);
		ПараметрыСоздания.Вставить("ТаблицаРегистраций", ТаблицаПринятыхРегистраций);
		ПараметрыСоздания.Вставить("ТипПробы", Объект.ТипПробы);
		ПараметрыСоздания.Вставить("ЭтоУсиленныйКонтрольДляТС", СтраницаУсиленныйКонтрольДляТС);

		Документы.гкс_ФормированиеНомераПробы.ДокументПромежуточногоКомпозита(ПараметрыСоздания,
			ПараметрыСозданияАнализа);

	Исключение

		ТекстОшибки = "Ошибка при создании документов: " + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);

		Возврат;

	КонецПопытки;

КонецПроцедуры

// Получение состояний качества для всех регистраций одним запросом
//
// Параметры:
//  ТаблицаРегистраций - ТаблицаЗначений - таблица с регистрациями, содержащая колонку ДокументРегистрации
//
// Возвращаемое значение:
//  Соответствие - ключ: ДокументРегистрации, значение: СостояниеКачества
//
&НаСервереБезКонтекста
Функция ПолучитьСостоянияКачестваРегистраций(ТаблицаРегистраций)

	МассивРегистраций = Новый Массив;
	Для Каждого СтрокаРегистрации Из ТаблицаРегистраций Цикл
		МассивРегистраций.Добавить(СтрокаРегистрации.ДокументРегистрации);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	СостоянияРегистрации.Состояние КАК СостояниеКачества
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(, ДокументРегистрации В (&МассивРегистраций)) КАК
	|		СостоянияРегистрации";

	Запрос.УстановитьПараметр("МассивРегистраций", МассивРегистраций);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	СостоянияКачества = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СостоянияКачества.Вставить(Выборка.ДокументРегистрации, Выборка.СостояниеКачества);
	КонецЦикла;

	Возврат СостоянияКачества;

КонецФункции

// Проверка, принято ли качество для регистрации
//
// Параметры:
//  СостояниеКачества - ПеречислениеСсылка.гкс_СостоянияРегистрации - состояние качества регистрации
//
// Возвращаемое значение:
//  Булево - Истина, если качество принято (пустое или "ОтборПроб")
//
&НаСервереБезКонтекста
Функция КачествоНеПринято(СостояниеКачества)

	СостоянияРегистраци = Новый СписокЗначений();
	СостоянияРегистраци.Добавить(Перечисления.гкс_СостоянияРегистрации.КачествоНеПринято);
	СостоянияРегистраци.Добавить(Перечисления.гкс_СостоянияРегистрации.НеПринято);

	Возврат ЗначениеЗаполнено(СостояниеКачества)
		И СостоянияРегистраци.НайтиПоЗначению(СостояниеКачества) <> Неопределено;

КонецФункции


// Заполнение показателей из документа НормативнаяСертификацияНоменклатуры
// для назначения использования "Промежуточный композит"
//
&НаСервере
Процедура ЗаполнитьПоказателиИзНормативнойСертификацииНаСервере(ДопПараметры)

	Если ПроверитьПараметры() Тогда
		Возврат;
	КонецЕсли;

	НормативныеПоказатели.Очистить();

	НазначениеИспользования = Перечисления.гкс_НазначенияИспользованияКачества.ДополнительныйАнализ;

	Период = Новый Структура("ДатаНачала, ДатаОкончания");
	Период.ДатаНачала = ДопПараметры.НачалоПериода;
	Период.ДатаОкончания = ДопПараметры.КонецПериода;

	Показатели = гкс_РаботаСПоказателямиНоменклатуры.НормативныеПоказатели(Объект.ТочкаМаршрута, Объект.Номенклатура,
		Объект.ВидПеревозки, НазначениеИспользования, Период);

	Для Каждого СтрокаПоказатели Из Показатели Цикл
		НормативныеПоказатели.Добавить(СтрокаПоказатели.Показатель);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПоказателей(ВыбранныеЗначения, ДополнительныеПараметры) Экспорт

	Если ВыбранныеЗначения = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ВыбранныеЗначения) = Тип("Массив") Тогда
		Для Каждого ВыбранныйПоказатель Из ВыбранныеЗначения Цикл
			ДобавитьПоказательВТаблицу(ВыбранныйПоказатель);
		КонецЦикла;
	Иначе
		ДобавитьПоказательВТаблицу(ВыбранныеЗначения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьДобавленныеПоказатели()
	ДобавленныеПоказатели = Новый Массив;

	Для Каждого СтрокаПоказателя Из Объект.Показатели Цикл
		Если ЗначениеЗаполнено(СтрокаПоказателя.Показатель) Тогда
			ДобавленныеПоказатели.Добавить(СтрокаПоказателя.Показатель);
		КонецЕсли;
	КонецЦикла;

	Возврат ДобавленныеПоказатели;

КонецФункции

&НаКлиенте
Процедура ДобавитьПоказательВТаблицу(Показатель)

	Для Каждого СтрокаПоказателя Из Объект.Показатели Цикл
		Если СтрокаПоказателя.Показатель = Показатель Тогда
			Возврат; // Показатель уже есть
		КонецЕсли;
	КонецЦикла;

	НоваяСтрока = Объект.Показатели.Добавить();
	НоваяСтрока.Показатель = Показатель;

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыДляНормативныхПоказателей(ДоступныеПоказатели)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);

	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);

	Если ДоступныеПоказатели.Количество() > 0 Тогда

		СписокОтбора = Новый СписокЗначений;
		Для Каждого Показатель Из ДоступныеПоказатели Цикл
			СписокОтбора.Добавить(Показатель);
		КонецЦикла;

		ОтборСтруктура = Новый Структура;
		ОтборСтруктура.Вставить("Ссылка", СписокОтбора);

		ФиксированныйОтбор = Новый ФиксированнаяСтруктура(ОтборСтруктура);
		ПараметрыФормы.Вставить("ФиксированныйОтбор", ФиксированныйОтбор);

		ПараметрыФормы.Вставить("Отбор", ОтборСтруктура);

	КонецЕсли;

	Возврат ПараметрыФормы;

КонецФункции

&НаКлиенте
Процедура ВыполнитьПроверкуНормативовПоказателя(ТекущиеДанные)

	НормативныеПоказателиМассив = НормативныеПоказатели.ВыгрузитьЗначения();
	Если НормативныеПоказателиМассив.Найти(ТекущиеДанные.Показатель) = Неопределено Тогда

		ТекстВопроса = "Не введен норматив на композиты. Продолжить создание лабораторного анализа?";

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);

		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПослеПодтвержденияДобавленияПоказателя", ЭтотОбъект, ДополнительныеПараметры),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияДобавленияПоказателя(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда

		ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
		Индекс = Объект.Показатели.Индекс(ТекущиеДанные);
		Если Индекс <> Неопределено Тогда
			Объект.Показатели.Удалить(Индекс);
		КонецЕсли;

	КонецЕсли;


КонецПроцедуры

&НаСервере
Функция ВыполнитьПроверкуСтраницы(ПараметрыСтраница)

	СтраницаУсиленныйКонтроль = ПараметрыСтраница.Свойство("СтраницаУсиленныйКонтроль");
	СтраницаУсиленныйКонтрольДляТС = ПараметрыСтраница.Свойство("СтраницаУсиленныйКонтрольДляТС");
	СтраницаПроизвольныйКомпозит = ПараметрыСтраница.Свойство("СтраницаПроизвольныйКомпозит");

	Возврат СтраницаУсиленныйКонтроль Или СтраницаПроизвольныйКомпозит Или СтраницаУсиленныйКонтрольДляТС ;
КонецФункции

#КонецОбласти
